import os
import sqlite3

DB_NAME = "customers.db"

# حذف فایل دیتابیس در صورت وجود
if os.path.exists(DB_NAME):
    os.remove(DB_NAME)

# ایجاد یا اتصال به دیتابیس
conn = sqlite3.connect(DB_NAME)
cursor = conn.cursor()

# ایجاد جدول در صورت عدم وجود
cursor.execute("""
CREATE TABLE customers (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    Phone TEXT,
    Fname TEXT,
    PerID TEXT,
    Tarikh TEXT,        
    Trip1 TEXT,
    Trip2 TEXT,
    Trip3 TEXT,
    Trip4 TEXT,
    Trip5 TEXT,
    Trip6 TEXT
)
""")
conn.commit()

# اضافه کردن اطلاعات به جدول

cursor.executemany("INSERT INTO customers (Phone, Fname, PerID, Tarikh, Trip1, Trip2, Trip3, Trip4, Trip5, Trip6) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)", [
    ("989374550876", "علیرضا کریمی", "99876", "1404/02/11", "06:20 Gol", "07:30 Teh", "08:40 Gol", "09:50 Hgd", "11:00 Gol", "12:15 Hgd"),
    ("989374550876", "علیرضا کریمی", "99876", "1404/02/12", "16:20", "17:30", "18:40", "19:50", "", ""),
    ("989374550876", "علیرضا کریمی", "99876", "1404/02/13", "17:20", "18:30", "19:40", "20:50", "", ""),
    ("+989374550876", "علیرضا کریمی", "99876", "1404/02/11", "26:20 Gol", "07:30 Teh", "08:40 Gol", "09:50 Hgd", "11:00 Gol", "12:15 Hgd"),
    ("+989374550876", "علیرضا کریمی", "99876", "1404/02/12", "26:20", "17:30", "18:40", "19:50", "", ""),
    ("+989374550876", "علیرضا کریمی", "99876", "1404/02/13", "27:20", "18:30", "19:40", "20:50", "", ""),
    ("989123946459", "حسین دشتی", "99447", "1404/02/09", "06:20 Gol", "07:30 Teh", "08:40 Gol", "09:50 Hgd", "11:00 Gol", "12:15 Hgd"),
    ("989123946459", "حسین دشتی", "99447", "1404/02/10", "16:20", "17:30", "18:40", "19:50", "", ""),
    ("989123946459", "حسین دشتی", "99447", "1404/02/11", "17:20", "18:30", "19:40", "20:50", "", "")
])
conn.commit()
conn.close()